# CopyImposterContentError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CopyImposterContentError Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Cannot copy Render Appearance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CopyImposterContentError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CopyImposterContentError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CopyImposterContentError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace